Revit 2027 API
Edge.Evaluate Method
Evaluates a parameter on the edge.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ Evaluate(
	double param
)
Public Function Evaluate (
	param As Double
) As XYZ
public:
XYZ^ Evaluate(
	double param
)
member Evaluate :
        param : float -> XYZ
Parameters
param Double
The parameter to be evaluated, in [0,1].
Return Value
XYZ
See Also
Reference
Edge Class
Autodesk.Revit.DB Namespace